<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Downloads the latest version of Microsoft PowerPoint and uploads it to Jamf Pro</string>
		<key>Identifier</key>
		<string>com.jackhenry.autopkg.digital-recipes.jamf.MicrosoftPowerPoint-upload</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Digital - Software</string>
			<key>NAME</key>
			<string>Microsoft PowerPoint</string>
			<key>UPDATE_PREDICATE_1</key>
			<string>patch_version_found == False</string>
			<key>UPDATE_PREDICATE_2</key>
			<string>pkg_uploaded == False</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.rtrouton.pkg.microsoftpowerpoint365</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle</key>
					<string>%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchChecker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE_1%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE_2%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
		</array>
	</dict>
</plist>