<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.download.Nudge</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Nudge</string>
		<key>PRERELEASE</key>
		<string></string>
		<key>TYPE</key>
		<string>_Suite</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.erikng.download.Nudge</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.erikng.download.Nudge</key>
			<dict>
				<key>git_hash</key>
				<string>d47211a7837e2d90342376a7ed1e83177a5e6b11</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.erikng-recipes/Nudge/Nudge.download.recipe</string>
				<key>sha256_hash</key>
				<string>b6e353e85d7950f9ed75ff29e4520425bd3a8477a6bb9cfbadefc4c97a0288bc</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
