<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Zoom for IT Admins and builds a package.

Configure Zoom for your organization with the CONFIG_PLIST Key.  Available settings can be found here:  
https://support.zoom.us/hc/en-us/articles/115001799006-Mass-Deployment-with-Preconfigured-Settings-for-Mac</string>
	<key>Identifier</key>
	<string>com.jackhenry.autopkg.digital-recipes.jamf.pkg.Zoom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zoom</string>
		<key>DOWNLOAD_URL</key>
		<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
		<key>CONFIG_PLIST</key>
		<string>&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;
&lt;!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\"&gt;
&lt;plist version=\"1.0\"&gt;
&lt;dict&gt;
	&lt;key&gt;nogoogle&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;nofacebook&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;ZAutoSSOLogin&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;ZSSOHost&lt;/key&gt;
	&lt;string&gt;yourVanityURL.zoom.us&lt;/string&gt;
	&lt;key&gt;enableembedbrowserforsso&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;PackageRecommend&lt;/key&gt;
		&lt;dict&gt;
			&lt;key&gt;ZDisableVideo&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;ZAutoJoinVoip&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;MuteVoipWhenJoin&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;ZAutoFitWhenViewShare&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;ZUse720PByDefault&lt;/key&gt;
			&lt;false/&gt;
			&lt;key&gt;ZRemoteControllAllApp&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;ZHideNoVideoUser&lt;/key&gt;
			&lt;false/&gt;
			&lt;key&gt;appendcallernameforroomsystem&lt;/key&gt;
			&lt;true/&gt;
		&lt;/dict&gt;
&lt;/dict&gt;
&lt;/plist&gt;</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.ZoomUS-ForIT</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/zoomus.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
		</dict>            
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/zoom.us.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleVersion</key>
					<string>version</string>
					<key>CFBundleShortVersionString</key>
					<string>jamfversion</string>
					<key>LSMinimumSystemVersion</key>
					<string>min_os_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_Zoom-ForIT.sh
# By:  Zack Thompson / Created:  5/25/2018
# Version:  1.0 / Updated:  5/25/2018 / By:  ZT
#
# Description:  This script installs the Zoom package with a configuration .plist.
#
###################################################################################################

echo "*****  Install Zoom-ForIT Process:  START  *****"

##################################################
# Define Variables

# Set working directory
	pkgDir=$(/usr/bin/dirname "${0}")
# Get the filename of the .dmg file
	ZoomPKG=$(/bin/ls "${pkgDir}" | /usr/bin/grep .pkg)
# Set the configuration .plist details
	configuration="%CONFIG_PLIST%"

##################################################
# Bits staged...

# Check the installation target.
if [[ $3 != "/" ]]; then
	echo "ERROR:  Target disk is not the startup disk."
	echo "*****  Install Zoom-ForIT process:  FAILED  *****"
	exit 1
fi

echo "Installing ${ZoomPKG}..."
exitResult=$(/usr/sbin/installer -dumplog -verbose -pkg "${pkgDir}/${ZoomPKG}" -allowUntrusted -target /)
exitCode=$?

if [[ $exitCode != 0 ]]; then
	echo "Installation FAILED!"
	echo "Reason:  ${exitResult}"
	echo "Exit Code:  ${exitCode}"
	echo "*****  Install Zoom-ForIT process:  FAILED  *****"
	exit 2
else
	echo "${2} has been installed!"
	echo "Installing custom configuration details..."
	/usr/bin/printf "${configuration}" > "${pkgDir}/us.zoom.config.plist"
	/bin/mv "${pkgDir}/us.zoom.config.plist" "/Library/Preferences/us.zoom.config.plist"
fi

echo "*****  Install Zoom-ForIT Process:  COMPLETE  *****"
exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/%NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>us.zoom.xos</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>