<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Downloads and configures the latest version of Zoom and uploads it to Jamf Pro</string>
		<key>Identifier</key>
		<string>com.jackhenry.autopkg.digital-recipes.jamf.Zoom-upload</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Digital - Software</string>
			<key>NAME</key>
			<string>Zoom</string>
			<key>CONFIG_PLIST</key>
			<string>&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;
&lt;!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\"&gt;
&lt;plist version=\"1.0\"&gt;
&lt;dict&gt;
	&lt;key&gt;ZAutoSSOLogin&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;ZSSOHost&lt;/key&gt;
	&lt;string&gt;jackhenry.zoom.us&lt;/string&gt;
	&lt;key&gt;enableembedbrowserforsso&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;nofacebook&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;zAutoUpdate&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;EnableSilentAutoUpdate&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;AlwaysCheckLatestVersion&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;disableDaemonInstall&lt;/key&gt;
	&lt;true/&gt;
	&lt;key&gt;PackageRecommend&lt;/key&gt;
		&lt;dict&gt;
			&lt;key&gt;ZDisableVideo&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;ZAutoJoinVoip&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;MuteVoipWhenJoin&lt;/key&gt;
			&lt;true/&gt;
			&lt;key&gt;ZAutoFitWhenViewShare&lt;/key&gt;
			&lt;true/&gt;
		&lt;/dict&gt;
&lt;/dict&gt;
&lt;/plist&gt;</string>
			<key>DOWNLOAD_URL</key>
			<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
			<key>UPDATE_PREDICATE_1</key>
			<string>patch_version_found == False</string>
			<key>UPDATE_PREDICATE_2</key>
			<string>pkg_uploaded == False</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.jackhenry.autopkg.digital-recipes.jamf.pkg.Zoom</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle</key>
					<string>%NAME%</string>
					<key>version</key>
					<string>%jamfversion%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchChecker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE_1%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE_2%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
		</array>
	</dict>
</plist>