<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Updates the Latest Policy and Patch Policy for Firefox</string>
		<key>Identifier</key>
		<string>com.jackhenry.autopkg.digital-recipes.jamf.Firefox-patch</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Firefox</string>
			<key>POLICY_ENABLED</key>
			<string>false</string>
			<key>POLICY_CATEGORY</key>
			<string>Digital - Software</string>
			<key>POLICY_NAME</key>
			<string>Latest %NAME%</string>
			<key>POLICY_TRIGGER</key>
			<string>install-firefox</string>
			<key>POLICY_TEMPLATE</key>
			<string>JamfPolicyTemplate-Latest.xml</string>
			<key>PATCH_ENABLED</key>
			<string>false</string>
			<key>PATCH_NAME</key>
			<string>Patch %NAME%</string>
			<key>PATCH_SOFTWARE_TITLE</key>
			<string>%NAME%</string>
			<key>PATCH_SOFTWARE_TITLE_ID</key>
			<string>52</string>
			<key>PATCH_TEMPLATE</key>
			<string>JamfPatchTemplate-TS.xml</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.jackhenry.autopkg.digital-recipes.jamf.Firefox-upload</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>true</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle_id</key>
					<string>%PATCH_SOFTWARE_TITLE_ID%</string>
					<key>patch_name</key>
					<string>%PATCH_NAME%</string>
					<key>patch_softwaretitle</key>
					<string>%PATCH_SOFTWARE_TITLE%</string>
					<key>patch_template</key>
					<string>%PATCH_TEMPLATE%</string>
					<key>replace_patch</key>
					<string>true</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult</string>
			</dict>
		</array>
	</dict>
</plist>
