<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Takes the provided EPP package, processes it, and uploads it to Jamf Pro.
Requires that you manually download the package from EPP place it in the Manual Uploads folder</string>
		<key>Identifier</key>
		<string>com.jackhenry.autopkg.digital-recipes.jamf.EndpointProtector-upload</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Digital - Software</string>
			<key>NAME</key>
			<string>Endpoint Protector</string>
			<key>UPDATE_PREDICATE_1</key>
			<string>patch_version_found == False</string>
			<key>UPDATE_PREDICATE_2</key>
			<string>pkg_uploaded == False</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>/Users/autopkg/Desktop/manual_uploads/EndpointProtector*.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%found_filename%</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: CoSoSys (TV3T7A76P4)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Endpoint_Protector.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Applications/EndpointProtectorClient.app/Contents/Info.plist</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleVersion</key>
						<string>version</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PlistReader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%found_filename%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/payload</string>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle</key>
					<string>%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchChecker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE_1%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE_2%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
		</array>
	</dict>
</plist>